emacs-init.org
#+TITLE: GNU Emacs package configuration file
#+AUTHOR: Wanderson Ferreira
#+EMAIL: wanderson.ferreira@protonmail.com

Welcome, this is my space where I can explore all the small details of
Emacs. If you know me personally, you know how much I brag about Emacs
and its philosophy.  However, I also try to do what I recommend to
people:

"Does not matter which editor/IDE you happen to like/use, but please,
learn it well."

The problem is that Emacs is a whole operating system which means you
can spent a lifetime here and does not scratch the surface of all
hidden treasures. Therefore, let's try to push the bar a little bit
higher this time.

* Startup

Since an error may occur in loading any file, I set some debugging
things so a debugger is entered if there's a problem. These get unset
after everything loads successfully.
#+BEGIN_SRC emacs-lisp
  (setq debug-on-error t
	debug-on-quit t)
#+END_SRC

Garbage collect on focus-out, Emacs should feel snappier.
#+BEGIN_SRC emacs-lisp
  (add-hook 'focus-out-hook #'garbage-collect)
#+END_SRC

Fix old security Emacs problems
#+BEGIN_SRC emacs-lisp
  (eval-after-load "enriched"
    '(defun enriched-decode-display-prop (start end &optional param)
       (list start end)))
#+END_SRC

* Personal information

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Wanderson Ferreira"
	user-mail-address "wanderson.ferreira@protonmail.com")
#+END_SRC

I like to organize my custom scripts and functions in a new folder. In
order to Emacs recognize that, we need to add the custom folder to the
classpath.

#+BEGIN_SRC emacs-lisp
  (defconst custom-dir (expand-file-name "custom" user-emacs-directory))
  (add-to-list 'load-path custom-dir)
#+END_SRC

Some very useful aliases
#+BEGIN_SRC emacs-lisp
(defalias 'cquit 'cider-quit)
(defalias 'ctest 'cider-test-run-test)
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

There is a nice mode to help you build a personal cheatsheet to help
you out while building your muscle memory.
#+BEGIN_SRC emacs-lisp
  (use-package cheatsheet 
    :ensure t
    :config
    (define-key cheatsheet-mode-map (kbd "q") 'delete-window)
    :bind
    ("C-h 0" . cheatsheet-show))
#+END_SRC

Also, I find that which-key provide a very nice starting point to
feature discovery inside Emacs.

#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :diminish which-key-mode
    :custom
    (which-key-separator " ")
    (which-key-prefix-prefix "+")
    :config
    (which-key-mode +1))
#+END_SRC

Emacs customize has little to no love by the community? this is a bold
statement, but in fact I myself never use it very often. Protesilaos,
has a very nice [[https://youtu.be/3A2hz6IGHzs?list=PL8Bwba5vnQK14z96Gil86pLMDO2GnOhQ6][walk through]] us through the front-end of Customize in
order to make it more accessible.

I like to keep all these changes in a separate file called `custom.el`
too.
#+BEGIN_SRC emacs-lisp
  (use-package cus-edit
    :custom
    (custom-file "~/.emacs.d/custom.el")
    :hook (after-init . (lambda ()
			  (unless (file-exists-p custom-file)
			    (write-region "" nil custom-file))
			  (load custom-file))))
#+END_SRC

* Operating System

I've been using qutebrowser as my main browser for more than one year
now. Idk, I like keyboard centric products.
#+BEGIN_SRC emacs-lisp
  (setq browse-url-browser-function 'browse-url-generic
	browse-url-generic-program "qutebrowser")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-copy-envs '("LANG" "LC_ALL" "LC_CTYPES" "JAVA_HOME" "PATH"))
  (exec-path-from-shell-initialize))
#+END_SRC

I like to have some shell commands accessible through emacs. Uptime is
an interesting info that I often want to know about.
#+BEGIN_SRC emacs-lisp
  (defun bk/uptime-box ()
    "Uptime your OS."
    (interactive)
    (message
     (shell-command-to-string "uptime")))
#+END_SRC

IP address? What is it right now?
#+BEGIN_SRC emacs-lisp
  (defun bk/ip ()
    "Find my current public IP address."
    (interactive)
    (let ((endpoint "https://api.ipify.org"))
      (message "IP: %s"
	       (with-current-buffer (url-retrieve-synchronously endpoint)
		 (buffer-substring (+ 1 url-http-end-of-headers) (point-max))))))
#+END_SRC

* Emacs Defaults

There are many options to customize in Emacs built-ins. For example, I
want to select a text and when I start type the new text, the selected
one should be deleted. To accomplish this there is a set of
modifications:

#+BEGIN_SRC emacs-lisp
  (add-hook 'after-init-hook 'delete-selection-mode)
#+END_SRC

Show current key-sequence in minibuffer, like vim does. Any feedback
after typing is better UX than no feedback at all.
#+BEGIN_SRC emacs-lisp
  (setq echo-keystrokes 0.02)
#+END_SRC

Typing yes/no is obnoxious when y/n will do
#+BEGIN_SRC emacs-lisp
  (fset #'yes-or-no-p #'y-or-n-p)
#+END_SRC

Emacs "updates" its ui more often than it needs to, so we slow it down slightly.
#+BEGIN_SRC emacs-lisp
  (setq idle-update-delay 1)
#+END_SRC

Also, when something changes below your feet, is always good idea to
be updated about that. For such situations we have the function
`auto-revert-mode' to update the buffer with new versions of the file
being visited. I would like this behavior was mandatory globally.

#+BEGIN_SRC emacs-lisp
  (add-hook 'after-init-hook #'global-auto-revert-mode)
#+END_SRC

Say you copied a link from your web browser, then switched to Emacs to
paste it somewhere. Before you do that, you notice something you want
to kill. Doing that will place the last kill to the clipboard, thus
overriding the thing you copied earlier. We can have a kill ring
solution:
#+BEGIN_SRC emacs-lisp
  (setq save-interprogram-paste-before-kill t)
#+END_SRC

The pop-to-mark-command is neat! You can place a mark in some place
and cycle through this positions easily.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x p") 'pop-to-mark-command)
#+END_SRC

Write backup files to own directory, but make a bunch of backup files
even if they are in version control directories.
#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist `(("." . ,(concat user-emacs-directory
						 "backups"))))
  (setq vc-make-backup-files t)
#+END_SRC

Don't autosave files or create lock/history/backup files. We don’t
want copies of potentially sensitive material floating around, and
we’ll rely on git and our own good fortune instead. Fingers crossed!

#+BEGIN_SRC emacs-lisp
  (setq create-lockfiles nil
        auto-save-default nil
        make-backup-files nil)
#+END_SRC

Don’t use tabs to indent and fix some indentation settings
#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil
                tab-width 4
                tab-always-indent 'complete
                fill-column 70)
#+END_SRC

Word wrapping
#+BEGIN_SRC emacs-lisp
  (setq-default word-wrap t
                truncate-lines t
                truncate-partial-width-windows nil
                sentence-end-double-space nil
                delete-trailing-lines nil
                require-final-newline t
                tabify-regexp "^\t* [ \t]+")
#+END_SRC

Favor hard-wrapping in text modes
#+BEGIN_SRC emacs-lisp
  (defun bk/auto-fill ()
    "My autofill setup for text buffers."
    (auto-fill-mode t)
    (diminish 'auto-fill-mode))

  (add-hook 'text-mode-hook #'bk/auto-fill)

#+END_SRC

Disable annoying blink-matching-paren
#+BEGIN_SRC emacs-lisp
  (setq blink-matching-paren nil)
#+END_SRC

Savehist keeps track of some history.
#+BEGIN_SRC emacs-lisp
  (require 'savehist)
  (setq savehist-additional-variables '(search-ring regexp-search-ring)
        savehist-autosave-interval 60
        history-delete-duplicates nil
        savehist-save-minibuffer-history t
        history-length 30000
        savehist-file (expand-file-name "savehist" user-emacs-directory))
  (savehist-mode +1)
#+END_SRC

This is a built-in mode that keeps track of the files you have opened,
allowing you go back to them faster. It can also integrate with a
completion framework to populate their "virtual buffers" list.

#+BEGIN_SRC emacs-lisp
  (require 'recentf)
  (setq recentf-save-file (expand-file-name "recentf" user-emacs-directory)
        recentf-max-saved-items 500
        recentf-max-menu-items 15
        recentf-show-file-shortcuts-flag nil
        recentf-auto-cleanup 'never)
  (recentf-mode +1)

  ;;; rename entries in recentf when moving files in dired
  (defun rjs/recentf-rename-directory (oldname newname)
    (setq recentf-list
          (mapcar (lambda (name)
                    (if (string-prefix-p oldname name)
                        (concat newname (substring name (length oldname)))))
                  recentf-list))
    (recentf-cleanup))

  (defun rjs/recentf-rename-file (oldname newname)
    (setq recentf-list
          (mapcar (lambda (name)
                    (if (string-equal name oldname)
                        newname
                      oldname))
                  recentf-list))
    (recentf-cleanup))

  (defun rjs/recentf-rename-notify (oldname newname &rest args)
    (if (file-directory-p newname)
        (rjs/recentf-rename-directory oldname newname)
      (rjs/recentf-rename-file oldname newname)))

  (advice-add 'dired-rename-file :after #'rjs/recentf-rename-notify)


  (defun contrib/recentf-add-dired-directory ()
    "Include Dired buffers in the `recentf' list."
    (when (and (stringp dired-directory)
               (equal "" (file-name-nondirectory dired-directory)))
      (recentf-add-file dired-directory)))

  (add-hook 'dired-mode-hook 'contrib/recentf-add-dired-directory)
#+END_SRC

Let’s try for the 1000x time, the highlighting of the current line.
#+BEGIN_SRC emacs-lisp
  (global-hl-line-mode +1)
#+END_SRC

After I learned about =M-x customize= I am reading some options there
that appeals me.

As I always remember from my first /init.el/ read, from Magnars,
"Emacs Kings do not use shift-selection-mode".
#+BEGIN_SRC emacs-lisp
  (setq shift-select-mode nil)
#+END_SRC

Let's see these trailing white-spaces.
#+BEGIN_SRC emacs-lisp
  (setq show-trailing-whitespace t)
#+END_SRC

More default settings
#+BEGIN_SRC emacs-lisp
  (setq-default ad-redefinition-action 'accept
                help-window-select t
                select-enable-clipboard t)
#+END_SRC

Don’t ping Germany when typing test.de<TAB>
#+BEGIN_SRC emacs-lisp
  (setq ffap-machine-p-known 'reject)
#+END_SRC

Just remember where the point is in any given file. This can often be
a subtle reminder of what you were doing the last time you visited
that file, allowing you to pick up from there.
#+BEGIN_SRC emacs-lisp
  (use-package saveplace
    :config
    (setq save-place-file "~/.emacs.d/saveplace"
          save-place-forget-unreadable-files t)
    (save-place-mode t))
#+END_SRC


Occur is basically the equivalent of =grep= in the terminal. What
makes =occur= really powerful it the ability to transform this buffer
into an editable buffer and bring all the power of Emacs to edit it.

