emacs-init.el
(setq debug-on-error t
      debug-on-quit t)

(add-hook 'focus-out-hook #'garbage-collect)

(eval-after-load "enriched"
  '(defun enriched-decode-display-prop (start end &optional param)
     (list start end)))

(setq user-full-name "Wanderson Ferreira"
      user-mail-address "wanderson.ferreira@protonmail.com")

(defconst custom-dir (expand-file-name "custom" user-emacs-directory))
(add-to-list 'load-path custom-dir)

(defalias 'cquit 'cider-quit)
(defalias 'ctest 'cider-test-run-test)
(defalias 'yes-or-no-p 'y-or-n-p)

(use-package cheatsheet 
  :ensure t
  :config
  (define-key cheatsheet-mode-map (kbd "q") 'delete-window)
  :bind
  ("C-h 0" . cheatsheet-show))

(use-package which-key
  :ensure t
  :diminish which-key-mode
  :custom
  (which-key-separator " ")
  (which-key-prefix-prefix "+")
  :config
  (which-key-mode +1))

(use-package cus-edit
  :custom
  (custom-file "~/.emacs.d/custom.el")
  :hook (after-init . (lambda ()
			(unless (file-exists-p custom-file)
			  (write-region "" nil custom-file))
			(load custom-file))))

(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "qutebrowser")

(use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-copy-envs '("LANG" "LC_ALL" "LC_CTYPES" "JAVA_HOME" "PATH"))
  (exec-path-from-shell-initialize))

(defun bk/uptime-box ()
  "Uptime your OS."
  (interactive)
  (message
   (shell-command-to-string "uptime")))

(defun bk/ip ()
  "Find my current public IP address."
  (interactive)
  (let ((endpoint "https://api.ipify.org"))
    (message "IP: %s"
	     (with-current-buffer (url-retrieve-synchronously endpoint)
	       (buffer-substring (+ 1 url-http-end-of-headers) (point-max))))))

(add-hook 'after-init-hook 'delete-selection-mode)

(setq echo-keystrokes 0.02)

(fset #'yes-or-no-p #'y-or-n-p)

(setq idle-update-delay 1)

(add-hook 'after-init-hook #'global-auto-revert-mode)

(setq save-interprogram-paste-before-kill t)

(global-set-key (kbd "C-x p") 'pop-to-mark-command)

(setq backup-directory-alist `(("." . ,(concat user-emacs-directory
					       "backups"))))
(setq vc-make-backup-files t)

(setq create-lockfiles nil
      auto-save-default nil
      make-backup-files nil)

(setq-default indent-tabs-mode nil
              tab-width 4
              tab-always-indent 'complete
              fill-column 70)

(setq-default word-wrap t
              truncate-lines t
              truncate-partial-width-windows nil
              sentence-end-double-space nil
              delete-trailing-lines nil
              require-final-newline t
              tabify-regexp "^\t* [ \t]+")

(defun bk/auto-fill ()
  "My autofill setup for text buffers."
  (auto-fill-mode t)
  (diminish 'auto-fill-mode))

(add-hook 'text-mode-hook #'bk/auto-fill)

(setq blink-matching-paren nil)

(require 'savehist)
(setq savehist-additional-variables '(search-ring regexp-search-ring)
      savehist-autosave-interval 60
      history-delete-duplicates nil
      savehist-save-minibuffer-history t
      history-length 30000
      savehist-file (expand-file-name "savehist" user-emacs-directory))
(savehist-mode +1)

(require 'recentf)
(setq recentf-save-file (expand-file-name "recentf" user-emacs-directory)
      recentf-max-saved-items 500
      recentf-max-menu-items 15
      recentf-show-file-shortcuts-flag nil
      recentf-auto-cleanup 'never)
(recentf-mode +1)

;;; rename entries in recentf when moving files in dired
(defun rjs/recentf-rename-directory (oldname newname)
  (setq recentf-list
        (mapcar (lambda (name)
                  (if (string-prefix-p oldname name)
                      (concat newname (substring name (length oldname)))))
                recentf-list))
  (recentf-cleanup))

(defun rjs/recentf-rename-file (oldname newname)
  (setq recentf-list
        (mapcar (lambda (name)
                  (if (string-equal name oldname)
                      newname
                    oldname))
                recentf-list))
  (recentf-cleanup))

(defun rjs/recentf-rename-notify (oldname newname &rest args)
  (if (file-directory-p newname)
      (rjs/recentf-rename-directory oldname newname)
    (rjs/recentf-rename-file oldname newname)))

(advice-add 'dired-rename-file :after #'rjs/recentf-rename-notify)


(defun contrib/recentf-add-dired-directory ()
  "Include Dired buffers in the `recentf' list."
  (when (and (stringp dired-directory)
             (equal "" (file-name-nondirectory dired-directory)))
    (recentf-add-file dired-directory)))

(add-hook 'dired-mode-hook 'contrib/recentf-add-dired-directory)

(global-hl-line-mode +1)

(setq shift-select-mode nil)

(setq show-trailing-whitespace t)

(setq-default ad-redefinition-action 'accept
              help-window-select t
              select-enable-clipboard t)

(setq ffap-machine-p-known 'reject)

(use-package saveplace
  :config
  (setq save-place-file "~/.emacs.d/saveplace"
        save-place-forget-unreadable-files t)
  (save-place-mode t))
