emacs-init.org
** Ibuffer

These settings make it easier to work with multiple buffers.

#+BEGIN_SRC emacs-lisp
  (use-package uniquify
    :config
    (setq uniquify-buffer-name-style 'post-forward-angle-brackets
          uniquify-separator " * "
          uniquify-after-kill-buffer-p t
          uniquify-strip-common-suffix t
          uniquify-ignore-buffers-re "^\\*"))
#+END_SRC


=ibuffer= is a built-in replacement for =buffer-list= that allows for
fine-grained control over the buffer list (both work similar to
dired).

#+BEGIN_SRC emacs-lisp
  (use-package ibuffer
    :config
    (setq ibuffer-expert t)
    (setq ibuffer-saved-filter-groups
         (quote (("Main"
                  ("Directories" (mode . dired-mode))
                  ("Programming" (or
                                  (mode . c-mode)
                                  (mode . clojure-mode)
                                  (mode . emacs-lisp-mode)
                                  (mode . python-mode)))
                  ("Org" (mode . org-mode))
                  ("Markdown" (mode . markdown-mode))
                  ("Magit" (or
                            (mode . magit-blame-mode)
                            (mode . magit-cherry-mode)
                            (mode . magit-diff-mode)
                            (mode . magit-log-mode)
                            (mode . magit-process-mode)
                            (mode . magit-status-mode)))
                  ("Emacs" (or
                            (name . "^\\*Help\\*$")
                            (name . "^\\*Custom.*")
                            (name . "^\\*Org Agenda\\*$")
                            (name . "^\\*info\\*$")
                            (name . "^\\*scratch\\*$")
                            (name . "^\\*Backtrace\\*$")
                            (name . "^\\*Messages\\*$")))))))
    :hook
    (ibuffer-mode . hl-line-mode)
    (ibuffer-mode . (lambda ()
                      (ibuffer-switch-to-saved-filter-groups "Main")))
    :bind
    (("C-x C-b" . ibuffer)))
#+END_SRC
** Electricity

Electric behavior for self inserting keys which are self inserting
keys which additionally perform some side operation which happens to
be often convenient at that time. Examples of such side operations
are: reindenting code, inserting a newline, =auto-fill-mode= and
=abbrev-mode= can be considered as built-in forms of electric key
behavior.

#+BEGIN_SRC emacs-lisp
  (electric-indent-mode +1)
#+END_SRC

One common way to quote is the typewriter convention, which quotes
using apostrophes ’like this’ or double-quotes "like this". Another
common way is the curved quote convention like ”like this”. The
electric quote mode makes it easier to type curved quotes.

#+BEGIN_SRC emacs-lisp
  (add-hook 'text-mode-hook 'electric-quote-local-mode)
#+END_SRC

If you want to suppress it for a single use, type =C-q `= or =C-q '=.

Electric layout mode is a global minor mode that automatically inserts
newlines when you type certain characters; for example ‘{’, ‘}’, ‘;’
in Javascript mode.

#+BEGIN_SRC emacs-lisp
  (electric-layout-mode +1)
#+END_SRC

** Register

Emacs registers are compartments where you can save text, rectangles,
positions, and other things for later use. Once you save text or a
rectangle in a register, you can copy it into the buffer once or many
times; once you save a position in a register, you can jump back to
that position once or many times.

For more information: `C-h r' and then letter *i* to search for
registers and the amazing video from [[https://youtu.be/u1YoF4ycLTY][Protesilaos]].

The prefix to all commands of registers is *C-x r*


| command             | description                         |
|---------------------+-------------------------------------|
| M-x view-register R | see what register R contains        |
| C-x r s             | save region to register             |
| C-x r i             | insert text from a register         |
| C-x r n             | record a number defaults to 0       |
| C-x r +             | increment a number from register    |
| C-x r SPC           | record a position into register     |
| C-x r j             | jump to positions or windows config |
| C-x r w             | save a window configuration         |
| C-x r f             | save a frame configuration          |


Important note: the data saved into the register is persistent as long
as you don't override it.

The way to specify a number, is to use an universal argument e.g.
*C-u <number> C-x n*


Clean all the registers you saved.
#+BEGIN_SRC emacs-lisp
  (defun bk/clear-registers ()
    "Remove all saved registers."
    (interactive)
    (setq register-alist nil))
#+END_SRC

** Search

Very important topic for me because I never know where my stuff is,
therefore I heavily rely on searching patterns to find it inside
buffers, frames, folders, projects and others.

Let's start by giving some help to Emacs grep. There are some folders
that I ignore when doing some search for example, target, vendors and
etc.

#+BEGIN_SRC emacs-lisp
  (require 'grep)

  (setq grep-highlight-matches t
	grep-scroll-output t)

  (eval-after-load "grep"
    '(progn
       (add-to-list 'grep-find-ignored-directories "target")
       (add-to-list 'grep-find-ignored-directories "elpa")
       (add-to-list 'grep-find-ignored-directories "vendor")
       (add-to-list 'grep-find-ignored-directories "node_modules")

       (define-key grep-mode-map "q" 'rgrep-quit-window)
       (define-key grep-mode-map (kbd "C-<return>") 'rgrep-goto-file-and-close-rgrep)
       (define-key grep-mode-map (kbd "C-x C-s") 'wgrep-save-all-buffers)))
#+END_SRC

This function help me day by day, every single version of my setup had
this beauty in it.
#+BEGIN_SRC emacs-lisp
  (defun bk/rgrep-fullscreen (regexp &optional files dir confirm)
    "Open grep in full screen, saving windows and searching for REGEXP.
  in FILES and DIR without CONFIRM."
    (interactive
     (progn
       (grep-compute-defaults)
       (let* ((regexp (grep-read-regexp))
              (files (grep-read-files regexp))
              (dir (ido-read-directory-name "Base directory: "
                                            nil default-directory t))
              (confirm (equal current-prefix-arg '(4))))
         (list regexp files dir confirm))))
    (window-configuration-to-register ?$)
    (rgrep regexp files dir confirm)
    (switch-to-buffer "*grep*")
    (delete-other-windows)
    (goto-char (point-min)))

  (defun rgrep-quit-window ()
    "Simply jump to the register where all your windows are."
    (interactive)
    (kill-buffer)
    (jump-to-register ?$))

  (defun rgrep-goto-file-and-close-rgrep ()
    "Go to file and close rgrep window."
    (interactive)
    (compile-goto-error)
    (kill-buffer "*grep*")
    (delete-other-windows)
    (message "Type C-x r j $ to return to pre-rgrep windows."))
#+END_SRC

*** Isearch

    You can invoke it using =C-s= and typing your desired search
    string. Also, if you want to use the regexp flavour you can use
    =M-C-s=.

    Run =C-h k C-s= yo get an /awesome/ help menu with all the extra
    keys you can use with =isearch=. These are the ones I use the
    most:

    | Keybindings                   | Description                                |
    |-------------------------------+--------------------------------------------|
    | C-s                           | search forward                             |
    | C-r                           | search backward                            |
    | M-C-s                         | search forward using regexp                |
    | M-C-r                         | search backward using regexp               |
    | C-s C-w                       | search word at point                       |
    | M-s                           | is a prefix while in isearch mode          |
    | (while isearch activated) M-r | turn your regular isearch into regexp mode |
    | M-s .                         | search for thing at point                  |
    | M-s o                         | get the results in occur buffer            |
    | M-s h r                       | highlight regexp                           |
    | M-s h u                       | undo the highlight                         |
    | C-s M-r                       | toggle regexp search                       |

** Authentication Source

Auth Source is a generic interface for common backends such as your
operating sysetm's keychain and your local ~/.authinfo file. Auth
Source solves the problem of mapping passwords and usernames to hosts.

Debugging auth issues
#+BEGIN_SRC emacs-lisp
  (setq auth-source-debug t)
#+END_SRC

We need to tell auth-source where to look for secrets.
#+BEGIN_SRC emacs-lisp
  (setq auth-sources '((:source "~/.emacs.d/secrets/.authinfo")))
#+END_SRC

