emacs-init.org
** Window

What are side windows? These windows is a place to put complementary
information to the main buffers. You can split or toggle fullscreen
for side windows. The builtin function *window-toggle-side-windows*
will record the current state of your side windows and toggle it when
you call the function again.

This is very useful if you want to keep some default windows around
while you edit in your main programming environment. For example, to
keep a eshell and dired buffer around.

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :custom
    (display-buffer-alist
     '(("\\*e?shell\\*"
	(display-buffer-in-side-window)
	(window-height . 0.30)
	(side . bottom)
	(slot . -1))
       ("\\*\\(Backtrace\\|Warnings\\|Compile-Log\\|Messages\\)\\*"
	(display-buffer-in-side-window)
	(window-height . 0.30)
	(side . bottom)
	(slot . 0))))
    :bind
    ("<f8>" . window-toggle-side-windows))
#+END_SRC

I like the idea of providing dired buffer as my sidebar. Usually I use
`dired-jump' to get into the dired buffer and make my changes this
function is inspired by Prot version for teaching purposes.

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :config
    (defun bk/window-dired-vc-root-left ()
      "Open root directory of current version-controlled repository
  or the present working directory with `dired' and bespoke window
  parametersg."
      (interactive)
      (let ((dir (if (eq (vc-root-dir) nil)
		     (dired-noselect default-directory)
		   (dired-noselect (vc-root-dir)))))
	(display-buffer-in-side-window
	 dir `((side . left)
	       (slot . 0)
	       (window-width . 0.15)))
	(with-current-buffer dir
	  (rename-buffer "*Dired-Side*"))))
    :bind
    ("C-c d" . bk/window-dired-vc-root-left))
#+END_SRC


Winner is a built-in tool that keeps a record of buffer and window
layout changes. It then allows us to move back and forth in the
history of said changes. The mnemonic is related to Emacs default
commands to operating on windows (C-x 4) and the undo operations with
[uU] letter. 

There are some buffers that winner will not restore, I list them in
the *winner-boring-buffers*.

#+BEGIN_SRC emacs-lisp
  (use-package winner
    :hook (after-init . winner-mode)
    :init
    (setq winner-boring-buffers
	  '("*Completions*"
	    "*Compile-Log*"
	    "*inferior-lisp*"
	    "*Fuzzy Completions*"
	    "*Apropos*"
	    "*Help*"
	    "*cvs*"
	    "*Buffer List*"
	    "*Ibuffer*"
	    "*esh command on file*"))
    :bind (("C-x 4 u" . winner-undo)
	   ("C-x 4 U" . winner-redo)))
#+END_SRC

Show time in modeline when using Emacs in fullscreen.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "<f9>") (lambda ()
				 (interactive)
				 (toggle-frame-fullscreen)
				 (sit-for 1)
				 (if (eq (cdr (assoc 'fullscreen (frame-parameters))) 'fullboth)
				     (display-time-mode 1)
				   (display-time-mode 0))))
#+END_SRC

When I fire any *Help* buffer, most of the time, I want to change
focus to that buffer automatically because I will need to perform some
action inside of it. Let's customize Emacs to have this behavior.

#+BEGIN_SRC emacs-lisp
  (setq help-window-select t)
#+END_SRC


The default Emacs distribution is very weak on window management.
While its notion of the "other window" is appropriate for two-window
layouts, it becomes a constraint whenever more windows need to be
displayed on the frame.

Let’s use =ace-window= to enhance the movement between windows.
#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :ensure t
    :custom
    (aw-keys '(?h ?j ?k ?l ?y ?u ?i ?o ?p))
    (aw-scope 'frame)
    (aw-dispatch-always t)
    (aw-dispatch-alist
     '((?s aw-swap-window "swap window")
       (?2 aw-split-window-vert "split window vertically")
       (?3 aw-split-window-horz "split window horizontally")
       (?? aw-show-dispatch-help)))
    (aw-minibuffer-flag t)
    (aw-ignore-current nil)
    (aw-display-mode-overlay t)
    (aw-background t)
    :config
    (ace-window-display-mode -1)
    (global-set-key (kbd "M-o") 'ace-window))
#+END_SRC

For quickly movement like go sideways/up and down we can use the
builtin package called =windmove=. We will use the Meta key as prefix
because all the other keys is bound to something more useful than
this.

#+BEGIN_SRC emacs-lisp
  (windmove-default-keybindings 'meta)
#+END_SRC

The idea is to use M-<arrows> to move.
** Cheatsheet from default behavior

No one should remember everything, only out mechanical memory can do
such amazing task. The cheatsheet is very helpful but it is worthless
if you don’t have the attitude of reaching for a *better way* every
single time you try to perform some operation inside Emacs in your
daily basis.

#+BEGIN_SRC emacs-lisp
  (cheatsheet-add-group 'Defaults
                        '(:key "C-x n s" :description "narrow region")
                        '(:key "M-s o" :description "fires occur")
                        '(:key "e (inside occur)" :description "turns into editable")
                        '(:key "= (inside occur)" :description "fires diff"))

#+END_SRC

* Aesthetics

We are in Lisp land, I really appreciate some help to figure out all
the parentheses visually.
#+BEGIN_SRC emacs-lisp
  (use-package paren
    :config
    (setq show-paren-delay 0.01
          show-paren-highlight-openparen t
          show-paren-when-point-inside-paren t
          show-paren-when-point-in-periphery t)
    (show-paren-mode +1))
#+END_SRC

Many major modes do not highlighting of number literals, so we do it
for them.
#+BEGIN_SRC emacs-lisp
  (use-package highlight-numbers
    :ensure t
    :config
    (setq highlight-numbers-generic-regexp "\\_<[[:digit:]]+\\(?:\\.[0-9]*\\)?\\_>"))
#+END_SRC

and structurally:
#+BEGIN_SRC emacs-lisp
  (electric-pair-mode)
#+END_SRC

Mode line settings
#+BEGIN_SRC emacs-lisp
  (line-number-mode t)
  (column-number-mode t)
  (size-indication-mode t)
#+END_SRC

Nice scrolling
#+BEGIN_SRC emacs-lisp
  (setq scroll-margin 0
        scroll-conservatively 100000
        scroll-preserve-screen-position 1)
#+END_SRC

More useful frame title, that should either a file or a buffer name
(if the buffer isn’t visiting a file)
#+BEGIN_SRC emacs-lisp
  (setq frame-title-format
        '("" invocation-name ": Bartuka - " (:eval (if (buffer-file-name)
                                                       (abbreviate-file-name (buffer-file-name))
                                                     "%b"))))
#+END_SRC

** Extra GUI

There are some GUI within default Emacs that is not really necessary
and only takes screen space. I like a very clean environment to focus
on what matter the most.

I usually remove the menu, toolbar, and scrollbar.

#+BEGIN_SRC emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+END_SRC


Removing the blinking cursor.
#+BEGIN_SRC emacs-lisp
  (and (fboundp 'blink-cursor-mode) (blink-cursor-mode (- (*) (*) (*))))
#+END_SRC

Inhibit dialog boxes.
#+BEGIN_SRC emacs-lisp
  (setq use-file-dialog nil
        use-dialog-box nil)
#+END_SRC

** Fontset
   Fira Code is a mono-spaced font with programming ligatures [[https://github.com/tonsky/FiraCode][Fira
Code]]. The idea behind is that programmers use a lot of symbols, often
encoded with several characters. Therefore, we have to spend some time
encoding these characters in our mind in order to translate their real
meaning.

Ligatures provides all these symbols for us. However, its setup is not
trivial in Linux, luckily I found this project [[https://github.com/johnw42/fira-code-emacs][Fira Code Emacs]] with
step-by-step process to setup Fira code and ligatures in Emacs and
Linux. In the `custom' folder of this repository, there is all the
files necessary to make the ligature to work. (if you previously
installed the Emacs variant provided by johnw42 above)

#+BEGIN_SRC emacs-lisp
  (require 'fira-code)
  (add-hook 'org-mode-hook #'fira-code-enable)
  (diminish 'ligature-font-mode)
#+END_SRC

Let's adjust the size of the font.
#+BEGIN_SRC emacs-lisp
  ;; (set-face-attribute 'default nil :height 100)
#+END_SRC

** Color Theme
Emacs always ask you if you want to load your new theme. The correct
portion of the documentation of `load-theme` function says:

"If the theme is not considered safe by 'custom-safe-themes', prompt
the user for confirmation before loading it. But if optional arg
NO-CONFIRM is non-nil, load the theme without prompting."

#+BEGIN_SRC emacs-lisp
  (use-package modus-operandi-theme
    :ensure t
    :config
    (load-theme 'modus-operandi t))
#+END_SRC

I want to have a my disposal at least two options of color theme to
work with. Usually during the day, my workstation is closer to a very
wide window so it is almost insane to try to use a dark background in
there (i try eventually), therefore I need a light background to
day-light and a dark one to other times.

#+BEGIN_SRC emacs-lisp
  (defun bk/light-theme ()
    "Custom light theme option."
    (interactive)
    (load-theme 'modus-operandi t))

  (defun bk/dark-theme ()
    "Custom dark theme option."
    (interactive)
    (load-theme 'modus-vivendi t))


#+END_SRC


Paren-face adds a face for parentheses, which is used by themes to
darken the parens.
#+BEGIN_SRC emacs-lisp
  (use-package paren-face
    :ensure t
    :config
    (global-paren-face-mode))
#+END_SRC

* Hydras

#+BEGIN_SRC emacs-lisp
  (use-package hydra
    :ensure t)
#+END_SRC

* Additional

Several times I need to move a line up and down the buffer. The
built-in solution for this is basically kill the text and yank it in
the new position because killing already place the text in the
kill-ring, so you do not need to copy --> cut --> paste, only cut -->
paste is enough.

Luckily, there is a package to improve this workflow by holding a key
and using the arrows.
#+BEGIN_SRC emacs-lisp
  (use-package move-dup
    :ensure t
    :config
    (global-set-key [C-up] 'md/move-lines-up)
    (global-set-key [C-down] 'md/move-lines-down))
#+END_SRC

There is always more to do in Emacs than we have words to explain.
** Region Selection

One of the functionalities I cannot live without is `expand-region' or
better described "extension to increase selected region by semantic
units". 

#+BEGIN_SRC emacs-lisp
  (use-package expand-region
    :ensure t
    :bind
    (("C-=" . er/expand-region)
     ("C--" . er/contract-region)))
#+END_SRC

** Packages

Restarting Emacs is usual when I am exploring some settings and can't
get back to its original state.
#+BEGIN_SRC emacs-lisp
  (use-package restart-emacs :ensure t)
#+END_SRC

*** Plantuml

Plantuml is an open-source tool allowing users to create UML diagrams
from a plain text language. Plantuml uses well-formed and
human-readable code to render the diagrams. More details about how to
design a specific diagram can be found [[https://plantuml.com/][here]].

#+BEGIN_SRC emacs-lisp
  (use-package plantuml-mode
    :ensure t
    :config
    (require 'ob-plantuml)
    (setq org-plantuml-jar-path "/home/wand/plantuml.jar"))
#+END_SRC

