emacs-init.el

(use-package emacs
  :custom
  (display-buffer-alist
   '(("\\*e?shell\\*"
      (display-buffer-in-side-window)
      (window-height . 0.30)
      (side . bottom)
      (slot . -1))
     ("\\*\\(Backtrace\\|Warnings\\|Compile-Log\\|Messages\\)\\*"
      (display-buffer-in-side-window)
      (window-height . 0.30)
      (side . bottom)
      (slot . 0))))
  :bind
  ("<f8>" . window-toggle-side-windows))

(use-package emacs
  :config
  (defun bk/window-dired-vc-root-left ()
    "Open root directory of current version-controlled repository
or the present working directory with `dired' and bespoke window
parametersg."
    (interactive)
    (let ((dir (if (eq (vc-root-dir) nil)
		   (dired-noselect default-directory)
		 (dired-noselect (vc-root-dir)))))
      (display-buffer-in-side-window
       dir `((side . left)
	     (slot . 0)
	     (window-width . 0.15)))
      (with-current-buffer dir
	(rename-buffer "*Dired-Side*"))))
  :bind
  ("C-c d" . bk/window-dired-vc-root-left))

(use-package winner
  :hook (after-init . winner-mode)
  :init
  (setq winner-boring-buffers
	'("*Completions*"
	  "*Compile-Log*"
	  "*inferior-lisp*"
	  "*Fuzzy Completions*"
	  "*Apropos*"
	  "*Help*"
	  "*cvs*"
	  "*Buffer List*"
	  "*Ibuffer*"
	  "*esh command on file*"))
  :bind (("C-x 4 u" . winner-undo)
	 ("C-x 4 U" . winner-redo)))

(global-set-key (kbd "<f9>") (lambda ()
			       (interactive)
			       (toggle-frame-fullscreen)
			       (sit-for 1)
			       (if (eq (cdr (assoc 'fullscreen (frame-parameters))) 'fullboth)
				   (display-time-mode 1)
				 (display-time-mode 0))))

(setq help-window-select t)

(use-package ace-window
  :ensure t
  :custom
  (aw-keys '(?h ?j ?k ?l ?y ?u ?i ?o ?p))
  (aw-scope 'frame)
  (aw-dispatch-always t)
  (aw-dispatch-alist
   '((?s aw-swap-window "swap window")
     (?2 aw-split-window-vert "split window vertically")
     (?3 aw-split-window-horz "split window horizontally")
     (?? aw-show-dispatch-help)))
  (aw-minibuffer-flag t)
  (aw-ignore-current nil)
  (aw-display-mode-overlay t)
  (aw-background t)
  :config
  (ace-window-display-mode -1)
  (global-set-key (kbd "M-o") 'ace-window))

(windmove-default-keybindings 'meta)

(cheatsheet-add-group 'Defaults
                      '(:key "C-x n s" :description "narrow region")
                      '(:key "M-s o" :description "fires occur")
                      '(:key "e (inside occur)" :description "turns into editable")
                      '(:key "= (inside occur)" :description "fires diff"))

(use-package paren
  :config
  (setq show-paren-delay 0.01
        show-paren-highlight-openparen t
        show-paren-when-point-inside-paren t
        show-paren-when-point-in-periphery t)
  (show-paren-mode +1))

(use-package highlight-numbers
  :ensure t
  :config
  (setq highlight-numbers-generic-regexp "\\_<[[:digit:]]+\\(?:\\.[0-9]*\\)?\\_>"))

(electric-pair-mode)

(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)

(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)

(setq frame-title-format
      '("" invocation-name ": Bartuka - " (:eval (if (buffer-file-name)
                                                     (abbreviate-file-name (buffer-file-name))
                                                   "%b"))))

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

(and (fboundp 'blink-cursor-mode) (blink-cursor-mode (- (*) (*) (*))))

(setq use-file-dialog nil
      use-dialog-box nil)

(require 'fira-code)
(add-hook 'org-mode-hook #'fira-code-enable)
(diminish 'ligature-font-mode)

;; (set-face-attribute 'default nil :height 100)

(use-package modus-operandi-theme
  :ensure t
  :config
  (load-theme 'modus-operandi t))

(defun bk/light-theme ()
  "Custom light theme option."
  (interactive)
  (load-theme 'modus-operandi t))

(defun bk/dark-theme ()
  "Custom dark theme option."
  (interactive)
  (load-theme 'modus-vivendi t))

(use-package paren-face
  :ensure t
  :config
  (global-paren-face-mode))

(use-package hydra
  :ensure t)

(use-package move-dup
  :ensure t
  :config
  (global-set-key [C-up] 'md/move-lines-up)
  (global-set-key [C-down] 'md/move-lines-down))

(use-package expand-region
  :ensure t
  :bind
  (("C-=" . er/expand-region)
   ("C--" . er/contract-region)))

(use-package restart-emacs :ensure t)

(use-package plantuml-mode
  :ensure t
  :config
  (require 'ob-plantuml)
  (setq org-plantuml-jar-path "/home/wand/plantuml.jar"))
