emacs-init.org
** Webjump

Provide a nice keyboard interface to web pages of your choosing.

Adding urban dictionary to webjump.
#+BEGIN_SRC emacs-lisp
  (eval-after-load "webjump"
    '(add-to-list 'webjump-sites '("Urban Dictionary" . [simple-query
							 "www.urbandictionary.com"
							 "http://www.urbandictionary.com/define.php?term="
							 ""])))

  (global-set-key (kbd "C-c j") 'webjump)
#+END_SRC

** Modes

Json mode is so useful.
#+BEGIN_SRC emacs-lisp
  (use-package json-mode
    :ensure t)
#+END_SRC

Unfortunately, I have to deal with YAML files on my daily basis.
#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :ensure t
    :config
    (add-hook 'yaml-mode-hook 'whitespace-mode)
    (add-hook 'yaml-mode-hook 'subword-mode))
#+END_SRC

* Multiple Cursors
#+BEGIN_SRC emacs-lisp
  (use-package multiple-cursors
    :ensure t
    :config
    (global-set-key (kbd "C->") 'mc/mark-next-like-this)
    (global-set-key (kbd "C-<") 'mc/mark-previous-like-this))
#+END_SRC

* Completion

The standard way of completion around the web is pressing `TAB` and
expecting something to happen. I like this behavior and Emacs allows
you to do the same with:

#+BEGIN_SRC emacs-lisp
  (setq tab-always-indent 'complete)
#+END_SRC

I already have a physical memory to fire `smex` instead of the
`execute-extended-command` to have access to Emacs interactive
function. What `smex` provides is a better search ordering the most
frequently used commands.

#+BEGIN_SRC emacs-lisp
  (use-package smex
    :ensure t
    :config
    (smex-initialize)
    :bind
    (("M-x" . smex)
     ("M-X" . smex-major-mode-commands)
     ("C-x C-m" . smex)))
#+END_SRC

** Ido

Ido - interactive do - help us with switching between buffers, opening
files and directories with a minimum of keystrokes. As you type in a
substring, the list of buffers or files currently matching the
substring are displayed as you type.

There is an amazing [[https://www.masteringemacs.org/article/introduction-to-ido-mode][Ido]] about Ido contains more details about how
to leverage its functionalities to improve your productivity.

#+BEGIN_SRC emacs-lisp
  (use-package ido
    :init
    (setq ido-enable-flex-matching t
	  ido-auto-merge-work-directories-length -1
	  ido-use-filename-at-point 'guess
	  ido-create-new-buffer 'always
	  ido-use-virtual-buffers t
	  ido-max-prospects 10
	  ido-max-window-height 1
	  ido-ignore-extensions t)
    (setq ido-file-extensions-order '(".clj" ".edn" ".org" ".md" ".el"))
    :config
    (ido-mode +1)
    (ido-everywhere +1)
    :bind (:map ido-common-completion-map
		("M-e" . ido-edit-input)
		("M-r" . ido-toggle-regexp)))
#+END_SRC

There is some corner places of Emacs where `ido-everywhere' does not
reach. However, we have some additional packages to help us with that.

#+BEGIN_SRC emacs-lisp
  (use-package ido-completing-read+
    :ensure t
    :config
    (ido-ubiquitous-mode +1))
#+END_SRC

Another place where ido-everywhere cannot reach is the `describe-face'
options. For that, we need to activate another package. It's very
helpful to have ido to help you with that, some times I want to modify
some aesthetics of my environment.

#+BEGIN_SRC emacs-lisp
  (use-package crm-custom
    :ensure t
    :config
    (crm-custom-mode +1))
#+END_SRC

For even older packages we have `icomplete' to enable ido-like behavior.
#+BEGIN_SRC emacs-lisp
  (use-package icomplete
    :config
    (icomplete-mode +1))
#+END_SRC

If =ido-switch-buffer= can’t find a match for the buffer name I’m
entering in the minibuffer, it asks me to confirm if I want to create
a new one. I always want to create it.

#+BEGIN_SRC emacs-lisp
  (defadvice ido-switch-buffer (around no-confirmation activate)
    (let ((confirm-nonexistent-file-or-buffer nil))
      ad-do-it))
#+END_SRC

Let's build a custom cheatsheet for our ido usage.
#+BEGIN_SRC emacs-lisp
  (cheatsheet-add-group 'Ido
			'(:key "C-b" :description "Reverts to the old 'switch-buffer' completion engine.")
			'(:key "C-f" :description "Reverts to the old 'file-name' completion engine.")
			'(:key "C-d" :description "Opens a dired buffer in the current directory.")
			'(:key "C-a" :description "Toggles ignored files.")
			'(:key "C-p" :description "Toggles prefix matching; match the beginning of a filename.")
			'(:key "M-r" :description "Toggles matching by Emacs regexp.")
			'(:key "C-k" :description "Kills the currently focused buffer or deletes the file")
			'(:key "M-m" :description "Creates a new subdirectory to the directory you are in."))
#+END_SRC

* Org

Changing some sensible defaults for Org mode. For example, it asks you
about every code block evaluation and it annoys me because if I typed
to evaluate why does I need to confirm it again?

#+BEGIN_SRC emacs-lisp
  (setq org-confirm-babel-evaluate nil)
#+END_SRC

I need to control the window that pops up when I open the Org Src
buffer to edit code.
#+BEGIN_SRC emacs-lisp
  (setq org-src-window-setup 'current-window)
#+END_SRC

Org agenda is something great! I need to rely more on that.
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files (list "~/calendar-captalys.org"
                               "~/todo.org"))


  (setq org-capture-templates
        '(("a" "Appointment Captalys" entry (file "~/calendar-captalys.org")
           "* %?\n\n%T\n\n:PROPERTIES:\n\n:END:\n\n")
          ("t" "To Do Item" entry (file+headline
                                   "~/todo.org" "To Do")
           "* TODO %?\n%u" :prepend t)))

  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-c l") 'org-store-link)
#+END_SRC

Add a timestamp when a task is done.
#+BEGIN_SRC emacs-lisp
  (setq org-log-done 'time)
#+END_SRC


** Calendar

Let's see if is possible to sync Google Calendar with Org mode. The
Org-gcal library enable you to fetch, post, edit and sync events from
your calendar.

There is a bit of setup outside Emacs to make it work, you can follow
the step-by-step guide on [[https://github.com/myuhe/org-gcal.el][Org Gcal Readme]] page.

#+BEGIN_SRC emacs-lisp
  (use-package org-gcal
    :ensure t
    :config
    (setq org-gcal-client-id (auth-source-pick-first-password
                              :host "gcal.com"
                              :user "client-id")
          org-gcal-client-secret (auth-source-pick-first-password
                                  :host "gcal.com"
                                  :user "client-secret")
          org-gcal-file-alist '(("wanderson.ferreira@captalys.com.br" . "~/gcal-captalys.org"))
          org-gcal-notify-p nil))
#+END_SRC


There are a couple of commands to remember:
#+caption: cheatsheet for Org Calendar
| command                  | description                                                                       |
|--------------------------+-----------------------------------------------------------------------------------|
| org-gcal-sync            | sync between org and gcal, before syncing, execute `org-gcal-fetch'               |
| org-gcal-fetch           | fetch google calendar events and populate org-gcal-file-alist                     |
| org-gcal-post-at-point   | post/edit org block at point to google calendar                                   |
| org-gcal-delete-at-point | delete gcal event at point                                                        |
| org-gcal-refresh-token   | refresh the oauth token, it expires in 3600s you should refresh in regular basis. |


I got these two hooks from Zemansky to sync things semi-automatically.
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync)))
#+END_SRC

The other way around, integrating Org bullets to Gmail seems to work
but with very basic functionalities. I wish I could create a full
appointment entry with invitations, location, and correct
duration. For now, I will keep using Google's UI to do that.

** Structure Templates

The "Easy Templates" as often is mentioned, is the standard way in
Emacs to handle inline code blocks when writing in literate
programming style.

You can find all the different available templates by `C-h v
org-structure-template-alist`.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist 
	       (list "elisp" (concat "#+BEGIN_SRC emacs-lisp\n"
				     "?\n"
				     "#+END_SRC")))
#+END_SRC

** Cheatsheet

Org mode has thousands of commands and we can't simply keep up with it
all in our heads. This is perfect usage for a cheatsheet.

#+BEGIN_SRC emacs-lisp
  (cheatsheet-add-group 'Org
			'(:key "C-c C-w" :description "Move item to other location"))
#+END_SRC

