emacs-init.el

(eval-after-load "webjump"
  '(add-to-list 'webjump-sites '("Urban Dictionary" . [simple-query
						       "www.urbandictionary.com"
						       "http://www.urbandictionary.com/define.php?term="
						       ""])))

(global-set-key (kbd "C-c j") 'webjump)

(use-package json-mode
  :ensure t)

(use-package yaml-mode
  :ensure t
  :config
  (add-hook 'yaml-mode-hook 'whitespace-mode)
  (add-hook 'yaml-mode-hook 'subword-mode))

(use-package multiple-cursors
  :ensure t
  :config
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this))

(setq tab-always-indent 'complete)

(use-package smex
  :ensure t
  :config
  (smex-initialize)
  :bind
  (("M-x" . smex)
   ("M-X" . smex-major-mode-commands)
   ("C-x C-m" . smex)))

(use-package ido
  :init
  (setq ido-enable-flex-matching t
	ido-auto-merge-work-directories-length -1
	ido-use-filename-at-point 'guess
	ido-create-new-buffer 'always
	ido-use-virtual-buffers t
	ido-max-prospects 10
	ido-max-window-height 1
	ido-ignore-extensions t)
  (setq ido-file-extensions-order '(".clj" ".edn" ".org" ".md" ".el"))
  :config
  (ido-mode +1)
  (ido-everywhere +1)
  :bind (:map ido-common-completion-map
	      ("M-e" . ido-edit-input)
	      ("M-r" . ido-toggle-regexp)))

(use-package ido-completing-read+
  :ensure t
  :config
  (ido-ubiquitous-mode +1))

(use-package crm-custom
  :ensure t
  :config
  (crm-custom-mode +1))

(use-package icomplete
  :config
  (icomplete-mode +1))

(defadvice ido-switch-buffer (around no-confirmation activate)
  (let ((confirm-nonexistent-file-or-buffer nil))
    ad-do-it))

(cheatsheet-add-group 'Ido
		      '(:key "C-b" :description "Reverts to the old 'switch-buffer' completion engine.")
		      '(:key "C-f" :description "Reverts to the old 'file-name' completion engine.")
		      '(:key "C-d" :description "Opens a dired buffer in the current directory.")
		      '(:key "C-a" :description "Toggles ignored files.")
		      '(:key "C-p" :description "Toggles prefix matching; match the beginning of a filename.")
		      '(:key "M-r" :description "Toggles matching by Emacs regexp.")
		      '(:key "C-k" :description "Kills the currently focused buffer or deletes the file")
		      '(:key "M-m" :description "Creates a new subdirectory to the directory you are in."))

(setq org-confirm-babel-evaluate nil)

(setq org-src-window-setup 'current-window)

(setq org-agenda-files (list "~/calendar-captalys.org"
                             "~/todo.org"))


(setq org-capture-templates
      '(("a" "Appointment Captalys" entry (file "~/calendar-captalys.org")
         "* %?\n\n%T\n\n:PROPERTIES:\n\n:END:\n\n")
        ("t" "To Do Item" entry (file+headline
                                 "~/todo.org" "To Do")
         "* TODO %?\n%u" :prepend t)))

(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c l") 'org-store-link)

(setq org-log-done 'time)

(use-package org-gcal
  :ensure t
  :config
  (setq org-gcal-client-id (auth-source-pick-first-password
                            :host "gcal.com"
                            :user "client-id")
        org-gcal-client-secret (auth-source-pick-first-password
                                :host "gcal.com"
                                :user "client-secret")
        org-gcal-file-alist '(("wanderson.ferreira@captalys.com.br" . "~/gcal-captalys.org"))
        org-gcal-notify-p nil))

(add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync)))

(add-to-list 'org-structure-template-alist 
	     (list "elisp" (concat "#+BEGIN_SRC emacs-lisp\n"
				   "?\n"
				   "#+END_SRC")))

(cheatsheet-add-group 'Org
		      '(:key "C-c C-w" :description "Move item to other location"))
