emacs-init.org
* Projects

#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (setq projectile-mode-line-prefix ""
          projectile-completion-system 'ido
          projectile-globally-ignored-files '("TAGS" ".DS_Store")
          projectile-switch-project-action 'projectile-find-file
          projectile-globally-ignored-file-suffixes '(".csv" ".svg" ".pdf" ".asc" ".doc" ".docx" ".csv"))
    :config
    (projectile-mode +1))
#+END_SRC

There is a nice package called =hydra= that allow you to make a nice
UI to remember operating some packages, for some reason I went by this
option several time and I only used it very occasionally. Let’s make
one of my favorite hydras.

#+BEGIN_SRC emacs-lisp
  (defhydra hydra-projectile (:color blue)
    ("q" nil "quit" :column "Projectile")

    ("b" projectile-switch-to-buffer "list" :column "Buffers")
    ("K" projectile-kill-buffers "kill all" :column "Buffers")
    ("S" projectile-save-project-buffers "save all" :column "Buffers")

    ("d" projectile-find-dir "directory" :column "Find")
    ("D" projectile-dired "root" :column "Find")
    ("f" projectile-find-file "file" :column "Find")
    ("p" projectile-switch-project "project" :column "Find")

    ("r" projectile-replace "replace" :column "Search")
    ("R" projectile-replace-regexp "regexp replace" :column "Search")
    ("g" bk/rgrep-fullscreen "grep" :column "Search"))
#+END_SRC

Now change the projectile prefix command to the hydra body.
#+BEGIN_SRC emacs-lisp
  (define-key projectile-mode-map (kbd "C-c p") 'hydra-projectile/body)
#+END_SRC


In the interest of performance, we reduce the number of project root
marker files/directories projectile searches for when resolving the
project root.
#+BEGIN_SRC emacs-lisp
  (setq projectile-project-root-files-bottom-up
        (append '(".project" ".git"))
        projectile-project-root-files '()
        projectile-project-root-files-top-down-recurring '("Makefile"))
#+END_SRC

Change projectile name in the modeline.
#+BEGIN_SRC emacs-lisp
  (defun projectile-short-mode-line ()
    "Short version of the default projectile mode line."
    (format " P[%s]" (projectile-project-name)))

  (setq projectile-mode-line-function 'projectile-short-mode-line)
#+END_SRC

* Dired 

Dired is very smart and usually finds the correct intent for some
situations, and all of this is able through the DWIM variable.
#+BEGIN_SRC emacs-lisp
  (setq dired-dwim-target t)
#+END_SRC

Improve how dired list the files and folders in the default buffer.
#+BEGIN_SRC emacs-lisp
  (setq dired-listing-switches "-la"
        dired-ls-F-marks-symlinks nil
        dired-auto-revert-buffer t
        dired-dwim-target t
        dired-recursive-copies 'always
        dired-recursive-deletes 'always)

  (add-hook 'dired-mode-hook
            (lambda ()
              (dired-hide-details-mode)
              (dired-sort-toggle-or-edit)))
#+END_SRC

The directory first using a more engineering approach.
#+BEGIN_SRC emacs-lisp
  (defun bk/dired-directories-first ()
    "Sort Dired listings with directories first."
    (save-excursion
      (let (buffer-read-only)
        (forward-line 2)
        (sort-regexp-fields t "^.*$" "[ ]*." (point) (point-max)))
      (set-buffer-modified-p nil)))

  (advice-add 'dired-readin :after #'bk/dired-directories-first)
#+END_SRC

Configuring the dired-jump command, I need to have access to the
current folder structure of my buffer.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-j") 'dired-jump)
#+END_SRC


A very nice feature is to be able to edit Dired buffers as regular
Emacs buffers. You can make several activities bearable using it, for
more details follow this [[https://www.masteringemacs.org/article/wdired-editable-dired-buffers][guide]]:

Let's also create a cheatsheet to dired mode. There are tons of
functionality there to remember and a quick reach set of notes will be
very helpful.

#+BEGIN_SRC emacs-lisp
  (cheatsheet-add-group 'Dired
			'(:key "C-x C-q" :description "Turn Dired mode editable."))
#+END_SRC

You can mark in Dired buffer based on a search using =% m=. By using
the letter =t= we can toggle the marked files. There is also the
command =k= that hide all the mark file from the current view.

You can always go back by pressing the better =g=

#+caption: commands from dired discovered in the process of narrowing
| chord | description                         |
|-------+-------------------------------------|
| % m   | mark files based on search          |
| t     | toggle mark                         |
| k     | hide marked files                   |
| g     | rebuild the original tree           |
| i     | list the content of a sub-directory |
| C-x u | dired undo                          |


** Functions

Some custom functions to help using Emacs with directories and buffers.
#+BEGIN_SRC emacs-lisp
  (defun eshell-cwd ()
    "Sets the eshell directory to the current buffer."
    (interactive)
    (let ((path (file-name-directory (or (buffer-file-name) default-directory))))
      (with-current-buffer "*eshell*"
	(cd path)
	(eshell-reset))))
#+END_SRC

Open a file at point with default application from my OS.
#+BEGIN_SRC emacs-lisp
  (defun bk/dired-xdg-open ()
    "Open the file at point with xdg-open."
    (interactive)
    (let ((file (dired-get-filename nil t)))
      (message "Opening %s..." file)
      (call-process "xdg-open" nil 0 nil file)
      (message "Opening %s done" file)))
#+END_SRC

* Shell

Clear the eshell buffer.
#+BEGIN_SRC emacs-lisp
  (defun eshell-clear-buffer ()
    "Clear the terminal buffer."
    (interactive)
    (let ((inhibit-read-only t))
      (erase-buffer)
      (eshell-send-input)))

  (add-hook 'eshell-mode-hook '(lambda ()
				 (local-set-key (kbd "C-l") 'eshell-clear-buffer)))
#+END_SRC

Explain some shell commands to me.
#+BEGIN_SRC emacs-lisp
  (defun bk/explain-shell (cmd)
    "Open a help browser for the CMD."
    (interactive (list (read-shell-command "Command: ")))
    (browse-url (format "http://explainshell.com/explain?cmd=%s"
			(url-encode-url cmd))))
#+END_SRC

I like to have a shortcut to open a new eshell instance.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c e") 'eshell)
#+END_SRC

Aliases ease the life of everybody.
#+BEGIN_SRC emacs-lisp
  (add-hook 'eshell-mode-hook
	    (lambda ()
	      (eshell/alias "e" "find-file $1")
	      (eshell/alias "emacs" "find-file $1")
	      (eshell/alias "ee" "find-file-other-window $1")
	      (eshell/alias "d" "dired $1")))
#+END_SRC

** TODO Explanation about basic eshell and some setup
** TODO need create-eshell-here
** TODO need visual-commands to work

* Git

#+BEGIN_SRC emacs-lisp
  (use-package git-timemachine
    :ensure t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t
    :config
    (setq magit-no-confirm '(stage-all-changes
                 unstage-all-changes))
    (setq magit-completing-read-function 'magit-ido-completing-read))
#+END_SRC

And what about another hydra? Magit deserves everything.
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-magit (:color blue)
    ("q" nil "quit" :column "Magit")
    ("b" magit-blame "blame" :column "Do")
    ("c" magit-clone "clone" :column "Do")
    ("i" magit-init "init" :column "Do")
    ("s" magit-status "status" :column "Do")
    ("t" git-timemachine "time-travel" :column "TimeMachine"))

  (global-set-key (kbd "C-c g") 'hydra-magit/body)
#+END_SRC

