emacs-init.el

(use-package projectile
  :ensure t
  :init
  (setq projectile-mode-line-prefix ""
        projectile-completion-system 'ido
        projectile-globally-ignored-files '("TAGS" ".DS_Store")
        projectile-switch-project-action 'projectile-find-file
        projectile-globally-ignored-file-suffixes '(".csv" ".svg" ".pdf" ".asc" ".doc" ".docx" ".csv"))
  :config
  (projectile-mode +1))

(defhydra hydra-projectile (:color blue)
  ("q" nil "quit" :column "Projectile")

  ("b" projectile-switch-to-buffer "list" :column "Buffers")
  ("K" projectile-kill-buffers "kill all" :column "Buffers")
  ("S" projectile-save-project-buffers "save all" :column "Buffers")

  ("d" projectile-find-dir "directory" :column "Find")
  ("D" projectile-dired "root" :column "Find")
  ("f" projectile-find-file "file" :column "Find")
  ("p" projectile-switch-project "project" :column "Find")

  ("r" projectile-replace "replace" :column "Search")
  ("R" projectile-replace-regexp "regexp replace" :column "Search")
  ("g" bk/rgrep-fullscreen "grep" :column "Search"))

(define-key projectile-mode-map (kbd "C-c p") 'hydra-projectile/body)

(setq projectile-project-root-files-bottom-up
      (append '(".project" ".git"))
      projectile-project-root-files '()
      projectile-project-root-files-top-down-recurring '("Makefile"))

(defun projectile-short-mode-line ()
  "Short version of the default projectile mode line."
  (format " P[%s]" (projectile-project-name)))

(setq projectile-mode-line-function 'projectile-short-mode-line)

(setq dired-dwim-target t)

(setq dired-listing-switches "-la"
      dired-ls-F-marks-symlinks nil
      dired-auto-revert-buffer t
      dired-dwim-target t
      dired-recursive-copies 'always
      dired-recursive-deletes 'always)

(add-hook 'dired-mode-hook
          (lambda ()
            (dired-hide-details-mode)
            (dired-sort-toggle-or-edit)))

(defun bk/dired-directories-first ()
  "Sort Dired listings with directories first."
  (save-excursion
    (let (buffer-read-only)
      (forward-line 2)
      (sort-regexp-fields t "^.*$" "[ ]*." (point) (point-max)))
    (set-buffer-modified-p nil)))

(advice-add 'dired-readin :after #'bk/dired-directories-first)

(global-set-key (kbd "C-x C-j") 'dired-jump)

(cheatsheet-add-group 'Dired
		      '(:key "C-x C-q" :description "Turn Dired mode editable."))

(defun eshell-cwd ()
  "Sets the eshell directory to the current buffer."
  (interactive)
  (let ((path (file-name-directory (or (buffer-file-name) default-directory))))
    (with-current-buffer "*eshell*"
      (cd path)
      (eshell-reset))))

(defun bk/dired-xdg-open ()
  "Open the file at point with xdg-open."
  (interactive)
  (let ((file (dired-get-filename nil t)))
    (message "Opening %s..." file)
    (call-process "xdg-open" nil 0 nil file)
    (message "Opening %s done" file)))

(defun eshell-clear-buffer ()
  "Clear the terminal buffer."
  (interactive)
  (let ((inhibit-read-only t))
    (erase-buffer)
    (eshell-send-input)))

(add-hook 'eshell-mode-hook '(lambda ()
			       (local-set-key (kbd "C-l") 'eshell-clear-buffer)))

(defun bk/explain-shell (cmd)
  "Open a help browser for the CMD."
  (interactive (list (read-shell-command "Command: ")))
  (browse-url (format "http://explainshell.com/explain?cmd=%s"
		      (url-encode-url cmd))))

(global-set-key (kbd "C-c e") 'eshell)

(add-hook 'eshell-mode-hook
	  (lambda ()
	    (eshell/alias "e" "find-file $1")
	    (eshell/alias "emacs" "find-file $1")
	    (eshell/alias "ee" "find-file-other-window $1")
	    (eshell/alias "d" "dired $1")))

(use-package git-timemachine
  :ensure t)

(use-package magit
  :ensure t
  :config
  (setq magit-no-confirm '(stage-all-changes
               unstage-all-changes))
  (setq magit-completing-read-function 'magit-ido-completing-read))

(defhydra hydra-magit (:color blue)
  ("q" nil "quit" :column "Magit")
  ("b" magit-blame "blame" :column "Do")
  ("c" magit-clone "clone" :column "Do")
  ("i" magit-init "init" :column "Do")
  ("s" magit-status "status" :column "Do")
  ("t" git-timemachine "time-travel" :column "TimeMachine"))

(global-set-key (kbd "C-c g") 'hydra-magit/body)
