emacs-init.org
* RSS

I like to read about programming, but Emacs and Clojure are by far the
most interesting communities I know so far, therefore, my feeds have
many links from these subjects.

#+BEGIN_SRC emacs-lisp
  (use-package elfeed
    :ensure t
    :init
    (setq-default elfeed-search-filter "@24-months-ago +unread")
    (setq elfeed-feeds
	  '(("http://lambda-the-ultimate.org/rss.xml" functional)
	    ("https://byorgey.wordpress.com/feed/" functional)
	    ("http://gigasquidsoftware.com/atom.xml" clojure)
	    ("http://swannodette.github.com/atom.xml" clojure)
	    ("https://rigsomelight.com/feed.xml" clojure)
	    ("http://planet.emacsen.org/atom.xml" emacs)
	    ("https://gigasquidsoftware.com/atom.xml" clojure)
	    ("https://lambdaisland.com/feeds/blog.atom" clojure)
	    ("https://nullprogram.com/feed/" programming)
	    ("http://feeds.feedburner.com/cognicast" clojure)
	    ("http://feeds2.feedburner.com/StuartSierra" clojure)
	    ("http://feeds.feedburner.com/Juxt" clojure)
	    ("http://blog.cognitect.com/blog?format=rss" clojure)
	    ("https://www.reddit.com/r/emacs/.rss" emacs)
	    ("http://feeds.feedburner.com/stevelosh?format=xml" clojure)
	    ("https://existentialtype.wordpress.com/feed/" functional)
	    ("http://planet.clojure.in/atom.xml" clojure)
	    ("http://insideclojure.org/feed.xml" clojure)
	    ("https://yogthos.net/feed.xml" clojure)
	    ("http://endlessparentheses.com/atom.xml" emacs)
	    ("http://www.blackhats.es/wordpress/?feed=rss2" emacs)
	    ("http://www.howardism.org/index.xml" emacs)
	    ("http://www.masteringemacs.org/feed/" emacs)
	    ("http://tonsky.me/blog/atom.xml" clojure)
	    ("https://danlebrero.com/feed.rss" programming)
	    ("http://www.clojure.net/rss.xml" clojure)
	    ("https://www.youtube.com/feeds/videos.xml?user=techguruuk" emacs)
	    ("http://emacsrocks.com/atom.xml" emacs)
	    ("http://emacs-fu.blogspot.com/feeds/posts/default" emacs)
	    ("http://yqrashawn.com/feeds/lazyblorg-all.atom_1.0.links-only.xml" emacs))))
#+END_SRC

By default, s run a live filter and you can type something like "Xah"
to dynamically narrow the list of stories to those containing that
string. The only problem is that you need an extra whitespace before
the word, " Xah", let's fix that.

#+BEGIN_SRC emacs-lisp
  (defun bk/elfeed-search-live-filter-space ()
    "Insert space when running elfeed filter"
    (interactive)
    (let ((elfeed-search-filter (concat elfeed-search-filter " ")))
      (elfeed-search-live-filter)))

  (define-key elfeed-search-mode-map (kbd "/") 'bk/elfeed-search-live-filter-space)
#+END_SRC

* Slack

Slack from Emacs? :O Why not? I am having a terrible time configuring
all my workspaces lately. Therefore, it sounds like a perfect
opportunity to leverage the best tool for the job once again.

#+BEGIN_SRC emacs-lisp
  (use-package slack
    :ensure t
    :init
    (setq slack-buffer-emojify t
	  slack-prefer-current-team t
	  slack-buffer-function #'switch-to-buffer
	  slack-completing-read-function #'ido-completing-read
	  slack-display-team-name nil)
    :config
    (slack-register-team
     :name "captalysdev"
     :default t
     :token (auth-source-pick-first-password
	     :host "slack.com"
	     :user "captalysdev")
     :subscribed-channels '(onboarding geral dev)
     :full-and-display-names t)

    (slack-register-team
     :name "clojurians"
     :token (auth-source-pick-first-password
	     :host "slack.com"
	     :user "clojurians")
     :subscribed-channels '(beginners reitit))

    (slack-register-team
     :name "captalys-oficial"
     :token (auth-source-pick-first-password
	     :host "slack.com"
	     :user "captalys-oficial")
     :subscribed-channels '(devops)
     :full-and-display-names t))

#+END_SRC

Bring up the mentions menu with `@', and insert a space afterwards.
#+BEGIN_SRC emacs-lisp
  (define-key slack-mode-map "@"
    (defun endless/slack-message-embed-mention ()
      (interactive)
      (call-interactively #'slack-message-embed-mention)
      (insert " ")))
#+END_SRC


CRUD on messages
#+BEGIN_SRC emacs-lisp
  (define-key slack-mode-map (kbd "C-c C-d") #'slack-message-delete)
  (define-key slack-mode-map (kbd "C-c C-e") #'slack-message-edit)
  (define-key slack-mode-map (kbd "C-c C-k") #'slack-channel-leave)
#+END_SRC

Circe is a client for IRC in Emacs. It tries to have sane defaults,
and integrates well with the rest of the editor.

#+BEGIN_SRC emacs-lisp
  (use-package circe :ensure t)
#+END_SRC

Emojify is an Emacs extension to display emojis.
#+BEGIN_SRC emacs-lisp

  (use-package emojify :ensure t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package alert
    :commands (alert)
    :init
    (setq alert-default-style 'libnotify))
#+END_SRC


How to use Slack on emacs? Some terminology from the website:

| Function                   | Description                                                                        |
|----------------------------+------------------------------------------------------------------------------------|
| im                         | an IM (instant message) is a direct message between you and exactly one other user |
| channel                    | A channel is a slack channel which you are a member of                             |
| group                      | Any chat (direct message or channel) which isn't an IM is a group                  |
| slack-register-team        | set team configuration and create team                                             |
| slack-change-current-team  | change slack-current-team var                                                      |
| slack-start                | do authorize and initialze                                                         |
| slack-ws-close             | turn off websocket connection                                                      |
| slack-group-select         | select group from list                                                             |
| slack-im-select            | select direct message from list                                                    |
| slack-channel-select       | select channel from list                                                           |
| slack-group-list-update    | update group list                                                                  |
| slack-channel-list-update  | update channel list                                                                |
| slack-message-embed-mentio | use to mention to user                                                             |
| slack-file-upload          | uploads a file                                                                     |
* Programming

Control your whitespaces!
#+BEGIN_SRC emacs-lisp
  (require 'whitespace)
  (setq whitespace-style '(trailing lines space-before-tab
                    indentation space-after-tab))
  (setq whitespace-line-column 100)
  (whitespace-mode +1)
#+END_SRC

A less intrusive ‘delete-trailing-whitespaces’ on save.
#+BEGIN_SRC emacs-lisp
  (use-package ws-butler
    :ensure t
    :diminish ws-butler-mode
    :config
    (ws-butler-global-mode +1))
#+END_SRC

Almost every where I wish paredit worked. This is a package to allow
structural parentheses editing. You stop thinking about the symbols
written in the buffer and begins to think in terms of sexps,
paragraphs, words, sentences, etc.

#+BEGIN_SRC emacs-lisp
  (use-package paredit
    :ensure t
    :diminish paredit-mode
    :config
    (add-hook 'lisp-mode-hook #'enable-paredit-mode)
    (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
    (add-hook 'clojure-mode-hook #'enable-paredit-mode))
#+END_SRC

Sometimes I place some TODO and FIXME words in the middle of my code
so I can come back to it latter and work on the subjects. The
following snippet will highlight these words to help me identify them.

#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook (defun bk--add-watchwords ()
			      (font-lock-add-keywords
			       nil `(("\\<\\(FIX\\(ME\\))?\\|TODO\\)"
				      1 font-lock-warning-face t)))))
#+END_SRC

Highlight TODO and similar keywords in comments and strings.
#+BEGIN_SRC emacs-lisp
  (use-package hl-todo
    :ensure t
    :init
    (setq hl-todo-keyword-faces
	'(("TODO"   . "#FF0000")
	  ("FIXME"  . "#FF0000")
	  ("DEBUG"  . "#A020F0")
	  ("GOTCHA" . "#FF4500")
	  ("STUB"   . "#1E90FF")))
    :config
    (global-hl-todo-mode +1))
  
  (global-set-key (kbd "C-x t p") 'hl-todo-previous)
  (global-set-key (kbd "C-x t n") 'hl-todo-next)
  (global-set-key (kbd "C-x t o") 'hl-todo-occur)
  (global-set-key (kbd "C-x t i") 'hl-todo-insert)
#+END_SRC


line numbers: explicitly define a width to reduce computation.
#+BEGIN_SRC emacs-lisp
  (setq-default display-line-numbers-width 3)
#+END_SRC

Show absolute line numbers for narrowed regions make it easier to tell
the buffer is narrowed, and where you are, exactly.
#+BEGIN_SRC emacs-lisp
  (setq-default display-line-numbers-widen t)
#+END_SRC

Enable line numbers in most text-editing modes.
#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
  (add-hook 'text-mode-hook #'display-line-numbers-mode)
  (add-hook 'conf-mode-hook #'display-line-numbers-mode)
#+END_SRC

Cheatsheet for highlight todo-like words
#+BEGIN_SRC emacs-lisp
  (cheatsheet-add-group 'TODO
			'(:key "C-x t n" :description "Find next TODO/FIXME")
			'(:key "C-x t p" :description "Find previous TODO/FIXME")
			'(:key "C-x t o" :description "Use occur to find all TODO or similar keywords")
			'(:key "C-x t i" :description "Insert TODO or similar keyword"))
#+END_SRC

** Flycheck

#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :ensure t
    :init
    (setq flycheck-check-syntax-automatically '(mode-enabled save))
    (global-flycheck-mode))
#+END_SRC

There is something very annoying happening with my setup. As I am
using =org-mode= to edit my configurations, I heavily rely on
=org-src-mode= however, flycheck understand this mode as a regular
buffer and every time I jump there it finds lots of errors as the
missing header and footer of a proper =*.el= file. I need to disable
it.

#+BEGIN_SRC emacs-lisp
  (defun disable-flycheck-in-org-src-block ()
    (setq-local flycheck-disabled-checkers '(emacs-lisp-checkdoc)))

  (add-hook 'org-src-mode-hook 'disable-flycheck-in-org-src-block)
#+END_SRC
