emacs-init.el

(use-package elfeed
  :ensure t
  :init
  (setq-default elfeed-search-filter "@24-months-ago +unread")
  (setq elfeed-feeds
	'(("http://lambda-the-ultimate.org/rss.xml" functional)
	  ("https://byorgey.wordpress.com/feed/" functional)
	  ("http://gigasquidsoftware.com/atom.xml" clojure)
	  ("http://swannodette.github.com/atom.xml" clojure)
	  ("https://rigsomelight.com/feed.xml" clojure)
	  ("http://planet.emacsen.org/atom.xml" emacs)
	  ("https://gigasquidsoftware.com/atom.xml" clojure)
	  ("https://lambdaisland.com/feeds/blog.atom" clojure)
	  ("https://nullprogram.com/feed/" programming)
	  ("http://feeds.feedburner.com/cognicast" clojure)
	  ("http://feeds2.feedburner.com/StuartSierra" clojure)
	  ("http://feeds.feedburner.com/Juxt" clojure)
	  ("http://blog.cognitect.com/blog?format=rss" clojure)
	  ("https://www.reddit.com/r/emacs/.rss" emacs)
	  ("http://feeds.feedburner.com/stevelosh?format=xml" clojure)
	  ("https://existentialtype.wordpress.com/feed/" functional)
	  ("http://planet.clojure.in/atom.xml" clojure)
	  ("http://insideclojure.org/feed.xml" clojure)
	  ("https://yogthos.net/feed.xml" clojure)
	  ("http://endlessparentheses.com/atom.xml" emacs)
	  ("http://www.blackhats.es/wordpress/?feed=rss2" emacs)
	  ("http://www.howardism.org/index.xml" emacs)
	  ("http://www.masteringemacs.org/feed/" emacs)
	  ("http://tonsky.me/blog/atom.xml" clojure)
	  ("https://danlebrero.com/feed.rss" programming)
	  ("http://www.clojure.net/rss.xml" clojure)
	  ("https://www.youtube.com/feeds/videos.xml?user=techguruuk" emacs)
	  ("http://emacsrocks.com/atom.xml" emacs)
	  ("http://emacs-fu.blogspot.com/feeds/posts/default" emacs)
	  ("http://yqrashawn.com/feeds/lazyblorg-all.atom_1.0.links-only.xml" emacs))))

(defun bk/elfeed-search-live-filter-space ()
  "Insert space when running elfeed filter"
  (interactive)
  (let ((elfeed-search-filter (concat elfeed-search-filter " ")))
    (elfeed-search-live-filter)))

(define-key elfeed-search-mode-map (kbd "/") 'bk/elfeed-search-live-filter-space)

(use-package slack
  :ensure t
  :init
  (setq slack-buffer-emojify t
	slack-prefer-current-team t
	slack-buffer-function #'switch-to-buffer
	slack-completing-read-function #'ido-completing-read
	slack-display-team-name nil)
  :config
  (slack-register-team
   :name "captalysdev"
   :default t
   :token (auth-source-pick-first-password
	   :host "slack.com"
	   :user "captalysdev")
   :subscribed-channels '(onboarding geral dev)
   :full-and-display-names t)

  (slack-register-team
   :name "clojurians"
   :token (auth-source-pick-first-password
	   :host "slack.com"
	   :user "clojurians")
   :subscribed-channels '(beginners reitit))

  (slack-register-team
   :name "captalys-oficial"
   :token (auth-source-pick-first-password
	   :host "slack.com"
	   :user "captalys-oficial")
   :subscribed-channels '(devops)
   :full-and-display-names t))

(define-key slack-mode-map "@"
  (defun endless/slack-message-embed-mention ()
    (interactive)
    (call-interactively #'slack-message-embed-mention)
    (insert " ")))

(define-key slack-mode-map (kbd "C-c C-d") #'slack-message-delete)
(define-key slack-mode-map (kbd "C-c C-e") #'slack-message-edit)
(define-key slack-mode-map (kbd "C-c C-k") #'slack-channel-leave)

(use-package circe :ensure t)

(use-package emojify :ensure t)

(use-package alert
  :commands (alert)
  :init
  (setq alert-default-style 'libnotify))

(require 'whitespace)
(setq whitespace-style '(trailing lines space-before-tab
                  indentation space-after-tab))
(setq whitespace-line-column 100)
(whitespace-mode +1)

(use-package ws-butler
  :ensure t
  :diminish ws-butler-mode
  :config
  (ws-butler-global-mode +1))

(use-package paredit
  :ensure t
  :diminish paredit-mode
  :config
  (add-hook 'lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'clojure-mode-hook #'enable-paredit-mode))

(add-hook 'prog-mode-hook (defun bk--add-watchwords ()
			    (font-lock-add-keywords
			     nil `(("\\<\\(FIX\\(ME\\))?\\|TODO\\)"
				    1 font-lock-warning-face t)))))

(use-package hl-todo
  :ensure t
  :init
  (setq hl-todo-keyword-faces
      '(("TODO"   . "#FF0000")
	("FIXME"  . "#FF0000")
	("DEBUG"  . "#A020F0")
	("GOTCHA" . "#FF4500")
	("STUB"   . "#1E90FF")))
  :config
  (global-hl-todo-mode +1))

(global-set-key (kbd "C-x t p") 'hl-todo-previous)
(global-set-key (kbd "C-x t n") 'hl-todo-next)
(global-set-key (kbd "C-x t o") 'hl-todo-occur)
(global-set-key (kbd "C-x t i") 'hl-todo-insert)

(setq-default display-line-numbers-width 3)

(setq-default display-line-numbers-widen t)

(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(add-hook 'text-mode-hook #'display-line-numbers-mode)
(add-hook 'conf-mode-hook #'display-line-numbers-mode)

(cheatsheet-add-group 'TODO
		      '(:key "C-x t n" :description "Find next TODO/FIXME")
		      '(:key "C-x t p" :description "Find previous TODO/FIXME")
		      '(:key "C-x t o" :description "Use occur to find all TODO or similar keywords")
		      '(:key "C-x t i" :description "Insert TODO or similar keyword"))

(use-package flycheck
  :ensure t
  :init
  (setq flycheck-check-syntax-automatically '(mode-enabled save))
  (global-flycheck-mode))

(defun disable-flycheck-in-org-src-block ()
  (setq-local flycheck-disabled-checkers '(emacs-lisp-checkdoc)))

(add-hook 'org-src-mode-hook 'disable-flycheck-in-org-src-block)
