emacs-init.org
** Elisp

Eval entire buffer and bring a nice message.
#+BEGIN_SRC emacs-lisp
  (defun bk/eval-buffer ()
    "Eval the entire buffer and gives a message if succedded"
    (interactive)
    (eval-buffer)
    (message "Successful evaluated."))

  (global-set-key (kbd "C-c C-k") 'bk/eval-buffer)
#+END_SRC

** Clojure

Emacs and Clojure is a perfect match! You can find more information
about this love affair in this [[https://youtu.be/O6g5C4jUCUc][video]].


**clojure-mode**: all you expects from a programming language major
  mode (and more!)
  - font-lock
  - indentation
  - navigation
  - refactoring

#+BEGIN_SRC emacs-lisp
  (use-package clojure-mode
    :ensure t
    :init
    (setq cljr-eagerly-build-asts-on-startup nil)
    :config
    (add-hook 'clojure-mode-hook (lambda ()
                                   (setq buffer-save-without-query t))))
#+END_SRC

Cider: Based on nREPL

  - Code completion
  - Navigating stack traces
  - Running tests
  - Debugger
  - So much more...

#+BEGIN_SRC emacs-lisp
  (use-package cider
    :ensure t
    :init
    (setq cider-popup-stacktraces t
          cider-popup-stacktraces-in-repl t
          cider-overlays-use-font-lock t)
    :config
    (add-hook 'clojure-mode-hook 'cider-mode)
    (use-package cider-eval-sexp-fu :ensure t))
#+END_SRC


#+BEGIN_SRC emacs-lisp
  (use-package clj-refactor
    :ensure t
    :init
    (setq cljr-warn-on-eval nil
          cljr-favor-prefix-notation nil)
    :config
    (add-hook 'clojure-mode-hook (lambda ()
                                   (clj-refactor-mode 1)
                                   (cljr-add-keybindings-with-prefix "C-c C-m")))
    (define-key clojure-mode-map (kbd "C-:") 'cljr-cycle-stringlike)
    (define-key clojure-mode-map (kbd "C-c >") 'cljr-cycle-coll))
#+END_SRC


The automatic indentation provided by =aggressive-ident-mode= is very
welcome in Clojure buffers.

#+BEGIN_SRC emacs-lisp
  (use-package aggressive-indent
    :ensure t
    :config
    (add-hook 'clojure-mode-hook 'aggressive-indent-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package flycheck-clj-kondo
    :ensure t)
#+END_SRC


Let’s build our cheat-sheet once again.
#+BEGIN_SRC emacs-lisp
  (cheatsheet-add-group 'Clojure
                        '(:key "C-c SPC" :description "Vertically align some forms")
                        '(:key "f (in report test buffer)" :description "Re-run the failing tests")
                        '(:key "C-u C-M-x" :description "Instrument a function to debug"))
#+END_SRC
** Python

#+BEGIN_SRC emacs-lisp
  (use-package elpy
    :ensure t
    :config
    (elpy-enable)
    (pyvenv-activate "~/miniconda3")
    (delete `elpy-module-django elpy-modules)
    (delete `elpy-module-highlight-indentation elpy-modules))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package py-autopep8
    :ensure t
    :init
    (setq py-autopep8-options '("--max-line-length=250"))
    :config
    (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save))
#+END_SRC

** Functions

Custom functions
#+BEGIN_SRC emacs-lisp
  (defun kill-cider-buffers ()
    "Kill all CIDER buffers without asking any questions.
  Useful to execute when Emacs gets stuck."
    (interactive)
    (cl-flet ((kill-buffer-ask (buffer) (kill-buffer buffer)))
      (let ((kill-buffer-query-functions
	     (delq 'process-kill-buffer-query-function kill-buffer-query-functions))))
      (kill-matching-buffers "cider")))
#+END_SRC

** Snippets

Yasnippet is a template system for Emacs. It allows you to type an
abbreviation and automatically expand it into function templates.

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :init
    (setq yas-prompt-functions '(yas-ido-prompt yas-completing-prompt))
    (setq yas-verbosity 1)
    (setq yas-wrap-around-region t)
    :config
    (yas-reload-all)
    (yas-global-mode +1))
#+END_SRC

But since some specific version, yasnippet does not bundles snippets
directly, you have to get them from third-party packages.

#+BEGIN_SRC emacs-lisp
  ;;; a snippet collection maintained by AndreaCrotti.
  (use-package yasnippet-snippets
    :ensure t)
#+END_SRC

I want to rely more on snippets on my day-to-day, therefore I need to
way to visualize if there is an existent snippet for a particular
situation. You can do that with `M-x yas/describe-table'. 


I will place that in my cheatsheet too and a nice shortcut: C-c s.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c s") '(lambda ()
				      (interactive)
				      (yas/describe-tables)
				      (other-window 1)))

#+END_SRC

Jump to end of snippet definition

#+BEGIN_SRC emacs-lisp
  (define-key yas-keymap (kbd "<return>") 'yas-exit-all-snippets)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (cheatsheet-add-group 'Snippets
			'(:key "M-x yas/describe-table" :description "Show available snippets in current mode")
			'(:key "C-c s" :description "Show available snippets in current mode"))
#+END_SRC

** Latex

#+BEGIN_SRC emacs-lisp
  (use-package tex-site
    :ensure auctex
    :config
    (require 'latex)
    (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
          TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
          TeX-source-correlate-start-server t)

    ;; to refresh the buffer after compilation
    (add-hook 'TeX-after-compilation-finished-functions
              #'TeX-revert-document-buffer))
#+END_SRC


#+BEGIN_SRC emacs-lisp
  (use-package reftex
    :ensure t
    :config
    (setq reftex-cite-prompt-optional-args t))

  (setq TeX-auto-save t
        TeX-parse-self t
        TeX-save-query nil
        TeX-PDF-mode t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-hook 'LaTeX-mode-hook 'visual-line-mode)
  (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  (add-hook 'LaTeX-mode-hook 'Latex-math-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)

  (with-eval-after-load 'tex
    (add-to-list 'safe-local-variable-values
                 '(TeX-command-extra-options . "-shell-escape")))
#+END_SRC

* Spelling

There are some helper functions to ease my life while editing
portuguese or english files.
#+BEGIN_SRC emacs-lisp
  (defun bk/spell-buffer-pt-BR ()
    "Function to spell check in Portuguese."
    (interactive)
    (ispell-change-dictionary "pt_BR")
    (flyspell-buffer))
#+END_SRC

If you want to go back to english!
#+BEGIN_SRC emacs-lisp
  (defun bk/spell-buffer-en ()
    "Function to spell check in English."
      (interactive)
      (ispell-change-dictionary "en_US")
      (flyspell-buffer))
#+END_SRC

I got the following setup from a bunch of different places, but mostly
from Spacemacs layer of spell checking. 

#+BEGIN_SRC emacs-lisp
  (defun spell-checking/change-dictionary ()
    "Change the dictionary. Use the ispell version if
  auto-dictionary is not used, use the adict version otherwise."
    (interactive)
    (if (fboundp 'adict-change-dictionary)
	(adict-change-dictionary)
      (call-interactively 'ispell-change-dictionary)))
#+END_SRC

An automatic dictionary switcher for Emacs spell checking. You just
have to enable it, start typing and when you stop for a few moments,
*auto-dictionaty-mode* will start evaluating the content. If you are
unhappy with the results, call *adict-change-dictionary* to change it
and stop automatic checks.

#+BEGIN_SRC emacs-lisp
  (use-package auto-dictionary
    :ensure t
    :disabled t
    :defer t
    :init
    (add-hook 'flyspell-mode-hook 'auto-dictionary-mode)
    (defun bk/adict-set-local-dictionary ()
      "Set the local dictionary if not nil."
      (when (and (fboundp 'adict-change-dictionary)
         ispell-local-dictionary)
    (adict-change-dictionary ispell-local-dictionary)))
    (add-hook 'auto-dictionary-mode-hook 'bk/adict-set-local-dictionary 'append))
#+END_SRC

Just enable the package.
#+BEGIN_SRC emacs-lisp
  (use-package flyspell
    :defer t
    :diminish flyspell-mode
    :commands (spell-checking/change-dictionary)
    :init
    (add-hook 'text-mode-hook 'flyspell-mode)
    (add-hook 'prog-mode-hook 'flyspell-prog-mode))
#+END_SRC

Correcting misspelled words with flyspell using favourite
interface. The idea is a distraction-free words correction.

#+BEGIN_SRC emacs-lisp
  (use-package flyspell-correct
    :ensure t
    :commands (flyspell-correct-word-generic
	       flyspell-correct-previous-word-generic))

  (require 'flyspell-correct-ido)
  (setq flyspell-correct-interface #'flyspell-correct-ido)
  (define-key flyspell-mode-map (kbd "C-;") 'flyspell-correct-wrapper)

#+END_SRC

By default the *flyspell-correct-wrapper* is the most convenient way
to use the package because it will jump to the first misspelled word
before the point and prompts for correction and gets you back. Calling
it with C-u gives ability to correct *multiple misspelled words* in
one run. With C-u C-u changes direction and C-u C-u C-u changes
direction and enables multiple corrections.

* Functions

Some custom functions to help me out here

** Kill buffer and delete its file
#+BEGIN_SRC emacs-lisp
  (defun bk/kill-buffer-and-file (buffer-name)
    "Removes file connected to current buffer and kills buffer."
    (interactive "bKill buffer and its file:")
    (let* ((buffer (get-buffer buffer-name))
	   (filename (buffer-file-name buffer)))
      (if (not (and filename (file-exists-p filename)))
	  (error "Buffer '%s' is not visiting a file!" buffer-name)
	(delete-file filename)
	(kill-buffer buffer))))
#+END_SRC

** Sudo editing

#+BEGIN_SRC emacs-lisp
  (defun bk/sudo-edit (&optional arg)
    "Function to edit file with super-user with optional ARG."
    (interactive "P")
    (if (or arg (not buffer-file-name))
        (find-file (concat "/sudo:root@localhost:" (read-file-name "File: ")))
      (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
#+END_SRC

