emacs-init.el

(defun bk/eval-buffer ()
  "Eval the entire buffer and gives a message if succedded"
  (interactive)
  (eval-buffer)
  (message "Successful evaluated."))

(global-set-key (kbd "C-c C-k") 'bk/eval-buffer)

(use-package clojure-mode
  :ensure t
  :init
  (setq cljr-eagerly-build-asts-on-startup nil)
  :config
  (add-hook 'clojure-mode-hook (lambda ()
                                 (setq buffer-save-without-query t))))

(use-package cider
  :ensure t
  :init
  (setq cider-popup-stacktraces t
        cider-popup-stacktraces-in-repl t
        cider-overlays-use-font-lock t)
  :config
  (add-hook 'clojure-mode-hook 'cider-mode)
  (use-package cider-eval-sexp-fu :ensure t))

(use-package clj-refactor
  :ensure t
  :init
  (setq cljr-warn-on-eval nil
        cljr-favor-prefix-notation nil)
  :config
  (add-hook 'clojure-mode-hook (lambda ()
                                 (clj-refactor-mode 1)
                                 (cljr-add-keybindings-with-prefix "C-c C-m")))
  (define-key clojure-mode-map (kbd "C-:") 'cljr-cycle-stringlike)
  (define-key clojure-mode-map (kbd "C-c >") 'cljr-cycle-coll))

(use-package aggressive-indent
  :ensure t
  :config
  (add-hook 'clojure-mode-hook 'aggressive-indent-mode))

(use-package flycheck-clj-kondo
  :ensure t)

(cheatsheet-add-group 'Clojure
                      '(:key "C-c SPC" :description "Vertically align some forms")
                      '(:key "f (in report test buffer)" :description "Re-run the failing tests")
                      '(:key "C-u C-M-x" :description "Instrument a function to debug"))

(use-package elpy
  :ensure t
  :config
  (elpy-enable)
  (pyvenv-activate "~/miniconda3")
  (delete `elpy-module-django elpy-modules)
  (delete `elpy-module-highlight-indentation elpy-modules))

(use-package py-autopep8
  :ensure t
  :init
  (setq py-autopep8-options '("--max-line-length=250"))
  :config
  (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save))

(defun kill-cider-buffers ()
  "Kill all CIDER buffers without asking any questions.
Useful to execute when Emacs gets stuck."
  (interactive)
  (cl-flet ((kill-buffer-ask (buffer) (kill-buffer buffer)))
    (let ((kill-buffer-query-functions
	   (delq 'process-kill-buffer-query-function kill-buffer-query-functions))))
    (kill-matching-buffers "cider")))

(use-package yasnippet
  :ensure t
  :init
  (setq yas-prompt-functions '(yas-ido-prompt yas-completing-prompt))
  (setq yas-verbosity 1)
  (setq yas-wrap-around-region t)
  :config
  (yas-reload-all)
  (yas-global-mode +1))

;;; a snippet collection maintained by AndreaCrotti.
(use-package yasnippet-snippets
  :ensure t)

(global-set-key (kbd "C-c s") '(lambda ()
				    (interactive)
				    (yas/describe-tables)
				    (other-window 1)))

(define-key yas-keymap (kbd "<return>") 'yas-exit-all-snippets)

(cheatsheet-add-group 'Snippets
		      '(:key "M-x yas/describe-table" :description "Show available snippets in current mode")
		      '(:key "C-c s" :description "Show available snippets in current mode"))

(use-package tex-site
  :ensure auctex
  :config
  (require 'latex)
  (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
        TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
        TeX-source-correlate-start-server t)

  ;; to refresh the buffer after compilation
  (add-hook 'TeX-after-compilation-finished-functions
            #'TeX-revert-document-buffer))

(use-package reftex
  :ensure t
  :config
  (setq reftex-cite-prompt-optional-args t))

(setq TeX-auto-save t
      TeX-parse-self t
      TeX-save-query nil
      TeX-PDF-mode t)

(add-hook 'LaTeX-mode-hook 'visual-line-mode)
(add-hook 'LaTeX-mode-hook 'flyspell-mode)
(add-hook 'LaTeX-mode-hook 'Latex-math-mode)
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)

(with-eval-after-load 'tex
  (add-to-list 'safe-local-variable-values
               '(TeX-command-extra-options . "-shell-escape")))

(defun bk/spell-buffer-pt-BR ()
  "Function to spell check in Portuguese."
  (interactive)
  (ispell-change-dictionary "pt_BR")
  (flyspell-buffer))

(defun bk/spell-buffer-en ()
  "Function to spell check in English."
    (interactive)
    (ispell-change-dictionary "en_US")
    (flyspell-buffer))

(defun spell-checking/change-dictionary ()
  "Change the dictionary. Use the ispell version if
auto-dictionary is not used, use the adict version otherwise."
  (interactive)
  (if (fboundp 'adict-change-dictionary)
      (adict-change-dictionary)
    (call-interactively 'ispell-change-dictionary)))

(use-package auto-dictionary
  :ensure t
  :disabled t
  :defer t
  :init
  (add-hook 'flyspell-mode-hook 'auto-dictionary-mode)
  (defun bk/adict-set-local-dictionary ()
    "Set the local dictionary if not nil."
    (when (and (fboundp 'adict-change-dictionary)
       ispell-local-dictionary)
  (adict-change-dictionary ispell-local-dictionary)))
  (add-hook 'auto-dictionary-mode-hook 'bk/adict-set-local-dictionary 'append))

(use-package flyspell
  :defer t
  :diminish flyspell-mode
  :commands (spell-checking/change-dictionary)
  :init
  (add-hook 'text-mode-hook 'flyspell-mode)
  (add-hook 'prog-mode-hook 'flyspell-prog-mode))

(use-package flyspell-correct
  :ensure t
  :commands (flyspell-correct-word-generic
	     flyspell-correct-previous-word-generic))

(require 'flyspell-correct-ido)
(setq flyspell-correct-interface #'flyspell-correct-ido)
(define-key flyspell-mode-map (kbd "C-;") 'flyspell-correct-wrapper)

(defun bk/kill-buffer-and-file (buffer-name)
  "Removes file connected to current buffer and kills buffer."
  (interactive "bKill buffer and its file:")
  (let* ((buffer (get-buffer buffer-name))
	 (filename (buffer-file-name buffer)))
    (if (not (and filename (file-exists-p filename)))
	(error "Buffer '%s' is not visiting a file!" buffer-name)
      (delete-file filename)
      (kill-buffer buffer))))

(defun bk/sudo-edit (&optional arg)
  "Function to edit file with super-user with optional ARG."
  (interactive "P")
  (if (or arg (not buffer-file-name))
      (find-file (concat "/sudo:root@localhost:" (read-file-name "File: ")))
    (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
