emacs-init.org
* Server

Emacs includes an optional client-server architecture. The benefit of
running emacs in server mode is that new client instances can be
started up instantaneously. If you have 100+ packages and starting
Emacs usually takes several seconds, using server mode creates a much
more streamlined workflow without sacrificing customization
functionality.

The process to start emacs as a daemon was followed by ArchWiki guide
to Emacs. Basically I added a *emacs.service* file at
=/usr/lib/systemd/user/= with the following content:

#+BEGIN_SRC shell
  [Unit]
  Description=Emacs text editor
  Documentation=info:emacs man:emacs(1) https://gnu.org/software/emacs/

  [Service]
  Type=simple
  ExecStart=/usr/bin/emacs --fg-daemon
  ExecStop=/usr/bin/emacsclient --eval "(kill-emacs)"
  Environment=SSH_AUTH_SOCK=%t/keyring/ssh
  Restart=on-failure

  [Install]
  WantedBy=default.target
#+END_SRC

And to activate it you need to run =systemcl --user enable --now emacs.service=

To entirely close a server started with =--daemon=, run *M-x
save-buffers-kill-emacs* in a frame.

I also need to unset some debugging capabilities.

#+BEGIN_SRC emacs-lisp
  (setq debug-on-error nil
	debug-on-quit nil)
#+END_SRC

