emacs-init.el

(setq debug-on-error nil
      debug-on-quit nil)
